 type TransactionTypeString =
    'Операция с карта' |
    'Издаване на превод във валута' |
    'Периодична такса' |
    'Такса за междубанков превод' |
    'Такса за превод' |
    'Такси издадени валутни преводи' |
    'Такса за вътрешнобанков превод' |
    'Такса за теглене над определена сума' |
    'Теглене на пари на каса от клнт с-к' |
    'Вътрешно банков превод Payroll' |
    'Плащане на лихва' |
    'Удържане на данък в/у лихва' |
    'Вътрешнобанков превод FC' |
    'Вътрешнобанков превод' |
    'Платежно нареждане извън банката' |
    'Комунално плащане mBanking' |
    'Комунално плaщане' |
    'Получен междубанков превод' |
    'Комунално плащане BBO' |
    'Получен вътр.банков превод' |
    'Периодично плащане' |
    'Погасяване на главница' |
    'Застрахователна премия' |
    'Погасяв.на л-ва за редовна главница' |
    'Издаден вътр.банков превод';

export default TransactionTypeString;