export const TRANSACTION_TYPES = [
    'Операция с карта' ,
    'Издаване на превод във валута' ,
    'Теглене на пари на каса от клнт с-к' ,
    'Периодична такса' ,
    'Такса за междубанков превод' ,
    'Такса за превод' ,
    'Такси издадени валутни преводи' ,
    'Такса за вътрешнобанков превод' ,
    'Такса за теглене над определена сума' ,
    'Вътрешно банков превод Payroll' ,
    'Вътрешнобанков превод FC' ,
    'Вътрешнобанков превод' ,
    'Издаден вътр.банков превод',
    'Плащане на лихва' ,
    'Удържане на данък в/у лихва' ,
    'Погасяване на главница' ,
    'Платежно нареждане извън банката' ,
    'Комунално плащане mBanking' ,
    'Комунално плaщане' ,
    'Комунално плащане BBO' ,
    'Получен междубанков превод' ,
    'Получен вътр.банков превод' ,
    'Периодично плащане' ,
    'Застрахователна премия' ,
    'Погасяв.на л-ва за редовна главница'
] as const;

export type TransactionTypeStringUnion = typeof TRANSACTION_TYPES[number];